sensebox/senseBoxMCU-core/arduino/samd/boards.txt

# custom menu
menu.power=Power

# senseBox MCU (SAMD21)
sb.name=senseBox MCU
sb.menu.power.on=ON as Default
sb.menu.power.off=OFF as Default
sb.menu.power.off.build.extra_flags=-D__SAMD21G18A__ -DSB_DEFAULT_POWER_OFF {build.usb_flags}
sb.vid.0=0x04D8
sb.pid.0=0xEF66
sb.vid.1=0x04D8
sb.pid.1=0xEF67
sb.bootloader.tool=openocd
sb.bootloader.file=sensebox_mcu.bin
sb.upload.tool=bossac
sb.upload.protocol=sam-ba
sb.upload.maximum_size=262144
sb.upload.use_1200bps_touch=true
sb.upload.wait_for_upload_port=true
sb.upload.native_usb=true
sb.build.mcu=cortex-m0plus
sb.build.f_cpu=48000000L
sb.build.board=SAMD_MKR1000
sb.build.variant=sensebox_mcu
sb.build.core=arduino:arduino
sb.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
sb.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
sb.build.openocdscript=openocd_scripts/sensebox_mcu.cfg
sb.build.vid=0x04D8
sb.build.pid=0xEF67
sb.build.usb_product="senseBox MCU"
sb.build.usb_manufacturer="senseBox"

# senseBox MCU (SAMD21) with 2nd stage OTA bootloader
sbota.name=senseBox MCU (WiFi OTA)
sbota.menu.power.on=ON as Default
sbota.menu.power.off=OFF as Default
sbota.menu.power.off.build.extra_flags=-D__SAMD21G18A__ -DSB_DEFAULT_POWER_OFF {build.usb_flags}
sbota.vid.0=0x04D8
sbota.pid.0=0xEF66
sbota.vid.1=0x04D8
sbota.pid.1=0xEF67
sbota.bootloader.tool=openocd
sbota.bootloader.file=sensebox_mcu.bin
sbota.upload.tool=bossac
sbota.upload.protocol=sam-ba
sbota.upload.maximum_size=262144
sbota.upload.use_1200bps_touch=true
sbota.upload.wait_for_upload_port=true
sbota.upload.native_usb=true
sbota.build.mcu=cortex-m0plus
sbota.build.f_cpu=48000000L
sbota.build.board=SAMD_MKR1000
sbota.build.variant=sensebox_mcu_ota
sbota.build.core=arduino:arduino
sbota.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
sbota.build.ldscript=linker_scripts/gcc/flash_with_ota.ld
sbota.build.openocdscript=openocd_scripts/sensebox_mcu.cfg
sbota.build.vid=0x04D8
sbota.build.pid=0xEF67
sbota.build.usb_product="senseBox MCU"
sbota.build.usb_manufacturer="senseBox"
